{
  "id": "20200618",
  "contentHtml": "<h2>間</h2>\n<p>意味</p>\n<ul>\n<li>It's meaning is while; during; or between.</li>\n</ul>\n<h3>How to use (使い方)</h3>\n<p>Noun + の</p>\n<ul>\n<li>食事の間、彼女と一緒に映画を見ました。</li>\n<li>While eating dinner, I watched a movie together with my girlfriend.</li>\n<li>学校にいる間は、スマホを使っていけません。</li>\n<li>We can't use our smartphones while in school.</li>\n</ul>\n<h3>While / During</h3>\n<ul>\n<li>電車に乗っている間、ずっと本を読んでいました。</li>\n<li>I read a book the entire time while on the train.</li>\n</ul>\n<h3>Between</h3>\n<ul>\n<li>名古屋は東京都大阪の間にあります。</li>\n<li>Nagoya is in between Tokyo and Osaka.</li>\n<li>９時から５時までの間、仕事です。</li>\n<li>I work from 9 to 5.</li>\n</ul>\n<h3>間とま</h3>\n<p>Used in some set phrases or to express something more figuration (time related).</p>\n<ul>\n<li>寝る魔もないほど忙しい。</li>\n<li>I'm too busy to sleep.</li>\n</ul>\n<h3>Examples</h3>\n<ul>\n<li>昨日は、家にいる間、ずっとテレビを見ていました。</li>\n<li>Yesterday, while at home, I watched TV all day.</li>\n<li>日本にいる間は、毎日日本語を話すつもりです。</li>\n<li>While I am in Japan, my intention is to speak Japanese everyday.</li>\n<li>サイクリングをしている間、ずっと雨が降っていました。</li>\n<li>While I was cycling, it rained all day.</li>\n<li>食事の間、彼女と一緒に映画を見ました。</li>\n<li>While eating, my girlfriend and I watched a movie together.</li>\n<li>学校にいる間は、スマホをを使ってはいけません。</li>\n<li>While in school, smartphones can't be used.</li>\n<li>バスに乗っている間、ずっと寝ていました。</li>\n<li>While riding the bus, I always got sleepy.</li>\n<li>バスを待っている間、後ろのおばあさんと話しをしていました。</li>\n<li>While waiting for the bus, I spoke with the grandma behind.</li>\n<li>日本にいる間は私の家に泊まって。</li>\n<li>While in Japan, stay at my house.</li>\n<li>あなたがここにいる間は私がいろいろ案内してあげましょう。</li>\n<li>While you are here, I give the favor of showing you around.</li>\n<li>この二人の間にどのような関係が生まれますか？</li>\n<li>Between these two, what kind of relationship is starting?</li>\n</ul>\n<h2>Conclusion</h2>\n<p>In essence, the usage of 間 is used to serve the purpose of doing something within a time frame. It is like doing something for a certain frame of time, like studying.</p>",
  "title": "While, during, between: あいだ",
  "date": "June 18, 2024",
  "category": "Personal",
  "categories": []
}