{
  "id": "20240111",
  "contentHtml": "<p>I name this blog entry dream core, because I think deeply about my ambitions. I intend to maintain physical and mental wellbeing and I have particular rituals to suffice these intentions.  I dream of everlasting happiness and fulfillment through meaningful connections, and finding my purpose. If I go into any activity, my hopes are to go into it with authenticity.</p>\n<ul>\n<li>Fitness. Evening, 9 PM.</li>\n<li>Studying. Morning, 7 AM.</li>\n<li>Productivity. 8 AM to 4 PM.</li>\n</ul>\n<p>A typical study session involves self-teaching. I learn new languages, new concepts, or think about my day-to-day activities. I go on long walks, hikes, or to the gym during the evening. Intense physical exercise helps me sleep well at night. Productivity often involves classes, work, or preparing for classes.</p>\n<ul>\n<li>Breakfast. 6 AM.</li>\n<li>Lunch. 12 PM.</li>\n<li>Dinner. 5 PM.</li>\n</ul>\n<p>My schedule for meals follow a 5 to 6 hour interval. I make an honest effort to avoid eating late in the night. There are various different meal preps for my daily diet. I tend to allow flexibility in cases like hangouts, dates, or other occasions.</p>\n<ul>\n<li>Eggs.</li>\n<li>Chicken breast.</li>\n<li>Tofu.</li>\n<li>Oats.</li>\n<li>Pasta.</li>\n<li>Sunflower, Flax, et cetera.</li>\n</ul>\n<p>These are typical ingredients I use for meal prep. At least, I find these to be my favorite. I cook on a daily basis and I prefer to eat eggs sunny side-up. I usually cut chicken breast in half and I think it goes well with tofu. I use oats, sunflower, flax for my smoothies. I cook pasta and make tomato sauce with diced tomatoes and other spices.</p>\n<ul>\n<li>Spinach.</li>\n<li>Kale.</li>\n<li>Arugula.</li>\n<li>Bananas.</li>\n<li>Almond milk.</li>\n<li>Chia seeds.</li>\n<li>Sunflower seeds.</li>\n<li>Flax.</li>\n<li>Hemp hearts.</li>\n<li>Spirulina.</li>\n<li>Peanut butter.</li>\n<li>Variety of berries.</li>\n<li>Mangoes.</li>\n</ul>\n<p>This list makes my smoothies appear complicated, but I often switch ingredients everyday. I have a calendar where I supplement different ingredients. I find my smoothies to be tasty when using almond milk, bananas, and peanut butter.</p>\n<p>The ideas and concepts I find most interesting come from various forms of media. I listen to plenty of music, watch anime, or movies. I think following a routine in my daily life helps to reach my goals. I leave room for ambiguity, and prefer flexible routines over stringent ones. However, routines are key to efficient time management.</p>",
  "title": "Dream Core",
  "date": "January 11, 2024",
  "category": "Personal",
  "categories": []
}